Repository: 0ut0fcontrol/webpage
Catalog: locale/*/LC_MESSAGES/index.po
Languages: de

source: The Fortran Programming Language
de: Die Fortran-Programmiersprache

source: High-performance parallel programming language
de: Hochperformanz, parallele Programmiersprache

source: Get started
de: Erste Schritte

source: Features
de: Besonderheiten

source: High performance
de: Hochperformanz

source: Fortran has been designed from the ground up for computationally intensive applications in science and engineering. Mature and battle-tested compilers and libraries allow you to write code that runs close to the metal, fast.
de: Fortran wurde von Grund auf für rechenintensiven Anwendungen in Wissenschaft und Ingenieurwissenschaften entwickelt. Ausgereift und bewährte Kompiler and Bibliotheken ermöglichen es, Code zu schreiben, der mit maximaler Performanz ausgeführt wird.

source: Statically and strongly typed
de: Statisch und stark typisiert

source: Fortran is statically and strongly typed, which allows the compiler to catch many programming errors early on for you. This also allows the compiler to generate efficient binary code.
de: Fortran ist statisch und stark typisiert, was dem Kompiler ermöglicht, viele Programmierfehler frühzeitig zu finden. Ebenso ermöglicht es dem Kompiler effizienten Binärcode zu generieren.

source: Easy to learn and use
de: Einfach zu lernen und zu verwenden

source: Fortran is a relatively small language that is surprisingly easy to learn and use. Expressing most mathematical and arithmetic operations over large arrays is as simple as writing them as equations on a whiteboard.
de: Fortran ist eine relativ kleine Sprache, die sehr einfach zu lernen und zu verwenden ist. Die meisten mathematischen und arithmetischen Operationen über große Arrays sind so einfach wie Gleichungen auf einer Tafel zu schreiben.

source: Versatile
de: Vielseitig

source: Fortran allows you to write code in a style that best fits your problem: imperative, procedural, array-oriented, object-oriented, or functional.
de: Fortran ermöglicht es, Code in einem Stil zu schreiben, der am besten zum Problem passt: Imperativ, Prozedural, Array-orientiert, Objektorientiert, oder Funktionell.

source: Natively parallel
de: Nativ parallel

source: Fortran is a natively parallel programming language with intuitive array-like syntax to communicate data between CPUs. You can run almost the same code on a single CPU, on a shared-memory multicore system, or on a distributed-memory HPC or cloud-based system. Coarrays, teams, events, and collective subroutines allow you to express different parallel programming patterns that best fit your problem at hand.
de: Fortran ist eine nativ parallele Programmiersprache mit intuitiver Array-ähnlicher Syntax, um Daten zwischen CPUs zu kommunizieren. Du kannst fast den gleichen Code auf einem einzelnen CPU, auf einem Multicore-System mit gemeinsamen Speicher, oder auf einem HPC- oder Cloud-basierten System mit verteilten Speicher ausführen. Coarrays, Teams, Events und kollektive Subroutinen ermöglichen es, verschiedene parallele Programmiermuster zu verwenden, die am besten auf Problem angepasst sind.

source: What is the status of Fortran?
de: Was ist der Status von Fortran?

source: [Fortran 2018](https://isotc.iso.org/livelink/livelink?func=ll&objId=19441669&objAction=Open),and the next one, with the working title Fortran 202x, is planned for release in the next few years. Further, open source projects like the [Standard Library](https://github.com/fortran-lang/stdlib) and the [Fortran Package Manager](https://github.com/fortran-lang/fpm) are in active development.
de: Fortran ist stets in aktiver Entwicklung. Die letzte Revision der Sprache ist [Fortran 2018](https://isotc.iso.org/livelink/livelink?func=ll&objId=19441669&objAction=Open), und die nächste mit dem Arbeitstitel Fortran 202x, wird in den nächsten Jahren veröffentlicht. Weitere, Open-Source-Projekte wie die [Standard-Bibliothek](https://github.com/fortran-lang/stdlib) und der [Fortran-Paketmanager](https://github.com/fortran-lang/fpm) befinden sich in aktiver Entwicklung.

source: What is Fortran used for?
de: Wofür wird Fortran verwendet?

source: Fortran is mostly used in domains that adopted computation early--science and engineering. These include numerical weather and ocean prediction, computational fluid dynamics, applied math, statistics, and finance. Fortran is the dominant language of High Performance Computing and is used to [benchmark the fastest supercomputers in the world](https://top500.org/).
de: Fortran wir hauptsächlich in Domänen verwendet, die stark von Rechnen gebrauch machen, Wissenschaft und Technik. Diese umfassen numerische Wetter- und Ozean-Vorhersage, Fluid-Dynamik, angewendete Mathematik, Statistik und Finanzen. Fortran ist die dominante Sprache von Hochperformanz-Computing und wird zum [Benchmark der schnellsten Supercomputern in der Welt](https://top500.org/) verwendet.

source: Should I use Fortran for my new project?
de: Sollte ich Fortran für mein neues Projekt verwenden?

source: If you're writing a program or a library to perform fast arithmetic computation over large numeric arrays, Fortran is the optimal tool for the job.
de: Wenn du ein Programm oder eine Bibliothek zum Berechnen von großen numerischen Arrays schreibst, ist Fortran das optimale Werkzeug für den Job.

source: Make Fortran better
de: Fortran besser machen

source: Write proposals
de: Entwürfe schreiben

source: Have an idea about how to improve the language? You can write new proposals or contribute to existing proposals to the Fortran Standard Committee on [GitHub](https://github.com/j3-fortran/fortran_proposals).
de: Hast du eine Idee, wie die Sprache verbessert werden kann? Du kannst unter [GitHub](https://github.com/j3-fortran/fortran_proposals) an neuen Entwürfe für das Fortran Standard-Kommittee schreiben oder zu existierenden Entwürfe beitragen.

source: Develop tools
de: Werkzeuge entwickeln

source: You can also help make Fortran better by contributing to its suite of tools, such as [Standard Library](https://github.com/fortran-lang/stdlib) ,[Package Manager](https://github.com/fortran-lang/fpm) ,[this website](https://github.com/fortran-lang/webpage).
de: Du kannst auch helfen, Fortran besser zu machen, indem du zu deren Suite von Werkzeugen beiträgst, wie zum Beispiel die [Standard-Bibliothek](https://github.com/fortran-lang/stdlib) , [Paketmanager](https://github.com/fortran-lang/fpm) oder zu [dieser Website](https://github.com/fortran-lang/webpage)

source: Write Fortran software
de: Fortran-Software schreiben

source: Or just write Fortran software for your research, business, or schoolwork. You can learn how to [get started here.](learn).
de: Oder schreibe nur Fortran-Software für deine Forschung, Unternehmen oder Schulwerk. Du kannst hier [anfangen](learn) die ersten Schritte zu lernen.
